
## Terraform plan for environment: `dev`

**Commit:** 254531a2b246bae69070f03003bed392a6a925a0


**API version:** c5ba4e9
**CLI version:** da12d1b
**Selfserve version:** c5ba4e9
**Internal version:** c5ba4e9

### Plan summary

`44 to add, 1 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
```
**🗑️ Deletes**

```tf
module.service.module.batch.aws_batch_job_definition.this["process-queue"]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_queue.this["default"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "permits:cancel-unsubmitted-bilateral",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "cancel-unsubmitted-bilateral"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-cancel-unsubmitted-bilateral"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:ch-vs-olcs-diffs",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "ch-vs-olcs-diffs"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-ch-vs-olcs-diffs"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:clean-up-variations",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "clean-up-variations"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-clean-up-variations"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "permits:close-expired-windows",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "close-expired-windows"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-close-expired-windows"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:cns",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "cns"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-cns"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "queue:company-profile-dlq",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "company-profile-dlq"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-company-profile-dlq"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:create-psv-licence-surrender-task",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "create-psv-licence-surrender-task"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-create-psv-licence-surrender-task"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:data-retention --delete",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "data-retention-delete"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-data-retention-delete"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:data-retention --populate",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "data-retention-populate"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-data-retention-populate"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:data-retention --postcheck",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "data-retention-postcheck"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-data-retention-postcheck"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:data-retention --precheck",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "data-retention-precheck"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-data-retention-precheck"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:database-maintenance",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "database-maintenance"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-database-maintenance"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:digital-continuation-reminders",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "digital-continuation-reminders"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-digital-continuation-reminders"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:duplicate-vehicle-warning",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "duplicate-vehicle-warning"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-duplicate-vehicle-warning"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:enqueue-ch-compare",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "enqueue-ch-compare"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-enqueue-ch-compare"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:expire-bus-registration",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "expire-bus-registration"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-expire-bus-registration"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:flag-urgent-tasks",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "flag-urgent-tasks"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-flag-urgent-tasks"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:import-users-from-csv",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "import-users-from-csv"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-import-users-from-csv"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:inspection-request-email",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "inspection-request-email"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-inspection-request-email"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:interim-end-date-enforcement",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "da12d1b"
                    },
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:da12d1b"
              + jobRoleArn                   = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301374200000005"
              + logConfiguration             = {
                  + logDriver = "awslogs"
                  + options   = {
                      + awslogs-group         = "/aws/batch/vol-app-dev"
                      + awslogs-region        = "eu-west-1"
                      + awslogs-stream-prefix = "interim-end-date-enforcement"
                    }
                }
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
              + runtimePlatform              = {
                  + cpuArchitecture       = "ARM64"
                  + operatingSystemFamily = "LINUX"
                }
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "vol-app-dev-interim-end-date-enforcement"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags_all                   = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 1

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                  + "batch:data-gov-uk-export",
                  + "-v",
                  + "--report-name=international-goods",
                  + "--path=/tmp/",
                ]
              + environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "... (truncated, see full plan in the workflow run logs)
```

</details>